In [10]:
# Dependencies and Setup
import pandas as pd
import numpy as np

# File to Load (Remember to Change These)
school_data_to_load = "Resources/schools_complete.csv"
student_data_to_load = "Resources/students_complete.csv"

# Read School and Student Data File and store into Pandas DataFrames
school_data = pd.read_csv(school_data_to_load)
student_data = pd.read_csv(student_data_to_load)

# Combine the data into a single dataset.  
school_data_complete = pd.merge(student_data, school_data, how="left", on=["school_name", "school_name"])
school_data_complete.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [11]:
# Create an overview table that summarizes key metrics about each school, including:

# School Name
# School Type
# Total Students
# Total School Budget
# Per Student Budget
# Average Math Score
# Average Reading Score
# % Passing Math
# % Passing Reading
# % Overall Passing (The percentage of students that passed math and reading.)
# Create a dataframe to hold the above results

In [14]:
#gives the full table grouped by school
clean_school_data_complete = school_data_complete.dropna(how="any")
clean_school_data_complete.count()

Student ID       39170
student_name     39170
gender           39170
grade            39170
school_name      39170
reading_score    39170
math_score       39170
School ID        39170
type             39170
size             39170
budget           39170
dtype: int64

In [15]:
clean_school_data_complete.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [18]:
converted_school_data = clean_school_data_complete.copy()
converted_school_data["math_score"] = converted_school_data.loc[:, "math_score"].astype(float)

In [19]:
converted_school_data.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79.0,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61.0,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60.0,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58.0,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84.0,0,District,2917,1910635

In [46]:
school_count = converted_school_data["school_name"].value_counts()
school_count

Bailey High School       4976
Johnson High School      4761
Hernandez High School    4635
Rodriguez High School    3999
Figueroa High School     2949
Huang High School        2917
Ford High School         2739
Wilson High School       2283
Cabrera High School      1858
Wright High School       1800
Shelton High School      1761
Thomas High School       1635
Griffin High School      1468
Pena High School          962
Holden High School        427
Name: school_name, dtype: int64

In [47]:
grouped_by_school_df = converted_school_data.groupby(["school_name"])

In [26]:
group_grades_df = huang_high_df.groupby(["grade"])
print(group_grades_df)
group_grades_df.count().head(10)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x0000027B330A84E0>

,Student ID,student_name,gender,school_name,reading_score,math_score,School ID,type,size,budget
grade,,,,,,,,,,
10th,767,767,767,767,767,767,767,767,767,767
11th,721,721,721,721,721,721,721,721,721,721
12th,585,585,585,585,585,585,585,585,585,585
9th,844,844,844,844,844,844,844,844,844,844

In [30]:
group_grades_df["math_score"].sum()

grade
10th    58222.0
11th    55118.0
12th    45177.0
9th     65011.0
Name: math_score, dtype: float64

In [33]:
math_sum = group_grades_df["math_score"].sum()
math_sum.head()

grade
10th    58222.0
11th    55118.0
12th    45177.0
9th     65011.0
Name: math_score, dtype: float64

In [35]:
reading_sum = group_grades_df["reading_score"].sum()
reading_sum.head()

grade
10th    62520
11th    58702
12th    46979
9th     68609
Name: reading_score, dtype: int64

In [37]:
school_summary_df = pd.DataFrame ({"Number of grades": grade_counts,
                                  "Sum of math grades": math_sum,
                                 "Sum of reading grades": reading_sum})
school_summary_df.head()

      Number of grades  Sum of math grades  Sum of reading grades
10th               767             58222.0                  62520
11th               721             55118.0                  58702
12th               585             45177.0                  46979
9th                844             65011.0                  68609

In [ ]:
#gives count of students by school
student_count_group = grouped_schools_df ["Student ID"].count()
student_count_group

In [ ]:
#Average reading scores by school
avg_reading_score_group = grouped_schools_df ["reading_score"].mean()
avg_reading_score_group

In [8]:
#Average reading scores by school
avg_math_score_group = grouped_schools_df ["math_score"].mean()
avg_math_score_group.head()

NameError: name 'grouped_schools_df' is not defined

In [9]:
school_summary_df = pd.DataFrame({"Schools":avg_math_score_group})
school_summary.head()

NameError: name 'avg_math_score_group' is not defined

In [32]:
school_summary_df = pd.DataFrame({"Schools":avg_math_score_group})
school_summary.head()

,Schools,Avg Math Score,Avg Reading Score
0,school_name Bailey High School 4976 Cabr...,school_name Bailey High School 77.048432...,school_name Bailey High School 77.048432...